target/test-classes/xml/ows/TC32044_createOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL">
                <contact type="BILLING" language="en_GB">
                    <title>Mr</title>
                    <firstName></firstName>
                    <lastName></lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress></emailAddress>
                    <birthDate>1985-01-01</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>6</buildingIdentifier>
                    <addressLine1>LUKIN STREET</addressLine1>
                    <town>LONDON</town>
                    <country>United Kingdom</country>
                    <postcode>E10AA</postcode>
                    <ptc_abs_code>PTCABS3075103</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username></username>
                    <password>password1</password>
                    <securityQuestion>Mothers maiden name?</securityQuestion>
                    <securityAnswer>smith</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>2</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="CARD">
                        <creditCard>
                            <cardName>CardName</cardName>
                            <cardNumber>5105105105105100</cardNumber>
                            <cardType>MC</cardType>
                            <cardExpiryDate>1130</cardExpiryDate>
                            <cvv>123</cvv>
                        </creditCard>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634143330730912784</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="false" termsAndConditionsAccepted="true" refundableDepositAccepted="false"/>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" devicePrint="DEVICEPRINT-AA" salesChannel="Onlines" externalSystemID="COCO" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <orderItem id="1" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile FC"></serviceRef>
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <simonly productCode="SIM-ONLY">
                        <deliveryMethod>DELIVER</deliveryMethod>
                    </simonly>
                    <discBundle bundleGroup="SB-GRP-A" productCode="02000-SB-A">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>CardName</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>1130</cardExpiryDate>
                    <cvv>123</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>